backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 102], ["LIMIT", 1]]
---
  def authenticate_user!
    return @current_user if defined?(@current_user)

    token = authorization_token
    raise JWT::DecodeError if token.blank?

    payload = JwtService.decode(token)
    @current_user = User.find(payload["user_id"] || payload[:user_id])