backend/app/controllers/auth_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Sam Reader"], ["email", "sam@example.com"], ["password_digest", "[FILTERED]"], ["role", 0], ["created_at", "2025-11-11 10:46:53.049705"], ["updated_at", "2025-11-11 10:46:53.049705"]]
---
  def signup
    user = User.new(signup_params.merge(role: :member))

    if user.save

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "login@example.com"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(email: login_params[:email].downcase)