backend/app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (LOWER(title) LIKE '%ruby%' OR LOWER(author) LIKE '%ruby%' OR LOWER(genre) LIKE '%ruby%')
SELECT 1 AS one FROM "books" WHERE "books"."title" = $1 AND "books"."author" = $2 LIMIT $3  [["title", "New Book"], ["author", "Author Name"], ["LIMIT", 1]]
---
  def index
    books = Book.all
    books = books.search(params[:q]) if params[:q].present?
    books = books.by_title(params[:title]) if params[:title].present?
    books = books.by_author(params[:author]) if params[:author].present?
    books = books.by_genre(params[:genre]) if params[:genre].present?

    render json: books.map { |book| book_response(book) }, status: :ok

INSERT INTO "books" ("title", "author", "genre", "isbn", "total_copies", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    book = Book.new(book_params)

    if book.save

UPDATE "books" SET "title" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["title", "Updated Title"], ["updated_at", "2025-11-11 10:50:22.971225"], ["id", 137]]
---
  def update
    if @book.update(book_params)

SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."book_id" = $1  [["book_id", 101]]
DELETE FROM "borrowings" WHERE "borrowings"."id" = $1  [["id", 131]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 219]]
---
  def destroy
    if @book.borrowings.active.exists?
      render json: { errors: ["Cannot delete book with active borrowings"] }, status: :unprocessable_content
      return
    end

    @book.destroy

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 217], ["LIMIT", 1]]
---
  def set_book
    @book = Book.find(params[:id])