backend/app/controllers/borrowings_controller.rb

  def index
    borrowings = if current_user.librarian?
                   Borrowing.includes(:book, :user).order(borrowed_at: :desc)
                 else
                   current_user.borrowings.includes(:book).order(borrowed_at: :desc)
                 end

    render json: borrowings.map { |borrowing| borrowing_response(borrowing) }, status: :ok
---
SELECT "books".* FROM "books" WHERE "books"."id" IN ($1, $2, $3, $4, $5)  [["id", 107], ["id", 106], ["id", 105], ["id", 1], ["id", 2]]
SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."user_id" = $1 ORDER BY "borrowings"."borrowed_at" DESC  [["user_id", 110]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4)  [["id", 114], ["id", 113], ["id", 112], ["id", 2]]

  def create
    return render json: { errors: ["Only members can borrow books"] }, status: :forbidden unless current_user.member?

    book = Book.find(borrowing_params[:book_id])
    borrowing = current_user.borrowings.new(
      book:,
      borrowed_at: Time.current,
      due_at: 2.weeks.from_now
    )

    if borrowing.save
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 146], ["LIMIT", 1]]
INSERT INTO "borrowings" ("user_id", "book_id", "borrowed_at", "due_at", "returned_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def set_borrowing
    @borrowing = Borrowing.find(params[:id])
---
SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."id" = $1 LIMIT $2  [["id", 72], ["LIMIT", 1]]