backend/app/controllers/dashboards_controller.rb

  def librarian_dashboard
    overdue_members = User.member
                          .joins(:borrowings)
                          .merge(Borrowing.overdue)
                          .distinct

    {
      total_books: Book.count,
      total_borrowed_books: Borrowing.active.count,
      books_due_today: Borrowing.due_on(Date.current).count,
      overdue_members: overdue_members.map do |member|
---
SELECT COUNT(*) FROM "books"

  def member_dashboard
    borrowings = current_user.borrowings.includes(:book)
    {
      borrowed_books: borrowings.map { |borrowing| borrowing_response(borrowing) },
      overdue_books: borrowings.overdue.map { |borrowing| borrowing_response(borrowing) }
---
SELECT "books".* FROM "books" WHERE "books"."id" IN ($1, $2)  [["id", 115], ["id", 116]]
SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."user_id" = $1  [["user_id", 126]]